package src.Lesson_5;

public class Task_5_2 {
    public static void main(String[] args) {
        System.out.println("Создать класс Friend (друг) с тремя инициализаторами (тремя методами initialize):\n" +
                "- Имя\n" +
                "- Имя, возраст\n" +
                "- Имя, возраст, пол");
        System.out.println("Создать класс Cat (кот) с пятью инициализаторами:\n" +
                "- Имя\n" +
                "- Имя, вес, возраст\n" +
                "- Имя, возраст (вес стандартный)\n" +
                "- вес, цвет, (имя, адрес и возраст неизвестны, это бездомный кот)\n" +
                "- вес, цвет, адрес (чужой домашний кот)\n");

    }
}
