package src.Lesson_1;

public class Task_0 {
    public static void main(String[] args) {

    System.out.println("Задание :Объявите переменные name1, name2, name3 типа String. " +
            "Сразу же в строке объявления присвойте им какие-нибудь значения." +
            " Значениями могут быть любые строки.");
        String name1 = "Я делаю задание";
        String name2 = "Программирую с удовольствием";
        String name3 = "Java - язык программирования";
    System.out.println("Задание :Напиши программу, которая выводит на экран надпись: «Когда я вырасту," +
            " то хочу быть паровым экскаватором!» 10 раз.");
    System.out.println("Задание :Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз."
            + "\n" + "Когда я вырасту, то хочу быть паровым экскаватором! 10 раз.");
    System.out.println("Задание :Раскоментируйте часть кода, чтобы на экран вывелось сообщение \"Happy New Year\"");
        System.out.println("Happy New Year");
    System.out.println("Задание :Внесите изменения в программу, чтобы переменная s была равна 5, t была равна 6," +
            " а x равна 7. Программа должна компилироваться.");
        int a = 5;
        int t = 6;
        int x = 7;
    System.out.println("Итоги присвоения чисел по заданию: " + "a = " + a + " t = " + t + " x = " + x);
    System.out.println("Задание :Вывести на экран текст");
    System.out.println("Меня зовут Амиго.\n" +
            "\n" +
            "Я согласен на зарплату $10/месяц в первый год.\n" +
            "Я согласен на зарплату $20/месяц во второй год.\n" +
            "Я согласен на зарплату $30/месяц в третий год.\n" +
            "Я согласен на зарплату $40/месяц в четвертый год.\n" +
            "Я согласен на зарплату $50/месяц в пятый год.\n" +
            "\n" +
            "Спасибо за щедрость, друг Риша!");
    System.out.println("Задание :написать программу, которая выводит на экран строки");
    System.out.println("Меня зовут Амиго.\n" +
            "\n" +
            "Я согласен на зарплату $800/месяц в первый год.\n" +
            "Я согласен на зарплату $1500/месяц во второй год.\n" +
            "Я согласен на зарплату $2200/месяц в третий год.\n" +
            "Я согласен на зарплату $2700/месяц в четвертый год.\n" +
            "Я согласен на зарплату $3200/месяц в пятый год.\n" +
            "\n" +
            "Поцелуй мой блестящий металлический зад!");
    System.out.println("Задание :Переставьте строки так, чтобы получился текст \"Nothing personal, it's just business.\"");
    String s1 = " it's just business.";
    String s2 = "Nothing personal,";
    System.out.println(s2 + s1);
    System.out.println("Задание :Объявите недостающие переменные и закоментарьте те, которые нигде не используются. " +
            " взял рандомное переменную обьявил и закоментировал");
    //int b
    System.out.println("Задание :Напиши программу, которая выводит на экран надпись: «Слава Роботам! Убить всех человеков!» 16 раз.");
    String text = "«Слава Роботам! Убить всех человеков!»";
    System.out.println(text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
            + "\n" + text
    );


    }
}
